is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecg144.h
extern volatile __CNPDJbits_t CNPDJbits __asm__ ("CNPDJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONJbits_t;
extern volatile __CNCONJbits_t CNCONJbits __asm__ ("CNCONJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIEJ0:1;
    unsigned CNIEJ1:1;
    unsigned CNIEJ2:1;
    unsigned CNIEJ3:1;
    unsigned CNIEJ4:1;
    unsigned CNIEJ5:1;
    unsigned CNIEJ6:1;
    unsigned CNIEJ7:1;
    unsigned CNIEJ8:1;
    unsigned CNIEJ9:1;
    unsigned CNIEJ10:1;
    unsigned CNIEJ11:1;
    unsigned CNIEJ12:1;
    unsigned CNIEJ13:1;
    unsigned CNIEJ14:1;
    unsigned CNIEJ15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENJbits_t;
extern volatile __CNENJbits_t CNENJbits __asm__ ("CNENJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATJ0:1;
    unsigned CNSTATJ1:1;
    unsigned CNSTATJ2:1;
    unsigned CNSTATJ3:1;
    unsigned CNSTATJ4:1;
    unsigned CNSTATJ5:1;
    unsigned CNSTATJ6:1;
    unsigned CNSTATJ7:1;
    unsigned CNSTATJ8:1;
    unsigned CNSTATJ9:1;
    unsigned CNSTATJ10:1;
    unsigned CNSTATJ11:1;
    unsigned CNSTATJ12:1;
    unsigned CNSTATJ13:1;
    unsigned CNSTATJ14:1;
    unsigned CNSTATJ15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATJbits_t;
extern volatile __CNSTATJbits_t CNSTATJbits __asm__ ("CNSTATJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJINV __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELK __attribute__((section("sfrs")));
typedef struct {
  unsigned w:32;
} __ANSELKbits_t;
extern volatile __ANSELKbits_t ANSELKbits __asm__ ("ANSELK") __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELKSET __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELKINV __attribute__((section("sfrs")));
extern volatile unsigned int        TRISK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISK0:1;
    unsigned TRISK1:1;
    unsigned TRISK2:1;
    unsigned TRISK3:1;
    unsigned TRISK4:1;
    unsigned TRISK5:1;
    unsigned TRISK6:1;
    unsigned TRISK7:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISKbits_t;
extern volatile __TRISKbits_t TRISKbits __asm__ ("TRISK") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISKSET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISKINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RK0:1;
    unsigned RK1:1;
    unsigned RK2:1;
    unsigned RK3:1;
    unsigned RK4:1;
    unsigned RK5:1;
    unsigned RK6:1;
    unsigned RK7:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTKbits_t;
extern volatile __PORTKbits_t PORTKbits __asm__ ("PORTK") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTKSET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTKINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATK0:1;
    unsigned LATK1:1;
    unsigned LATK2:1;
    unsigned LATK3:1;
    unsigned LATK4:1;
    unsigned LATK5:1;
    unsigned LATK6:1;
    unsigned LATK7:1;
  };
  struct {
    unsigned w:32;
  };
} __LATKbits_t;
extern volatile __LATKbits_t LATKbits __asm__ ("LATK") __attribute__((section("sfrs")));
extern volatile unsigned int        LATKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATKSET __attribute__((section("sfrs")));
extern volatile unsigned int        LATKINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCK0:1;
    unsigned ODCK1:1;
    unsigned ODCK2:1;
    unsigned ODCK3:1;
    unsigned ODCK4:1;
    unsigned ODCK5:1;
    unsigned ODCK6:1;
    unsigned ODCK7:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCKbits_t;
extern volatile __ODCKbits_t ODCKbits __asm__ ("ODCK") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCKSET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUK0:1;
    unsigned CNPUK1:1;
    unsigned CNPUK2:1;
    unsigned CNPUK3:1;
    unsigned CNPUK4:1;
    unsigned CNPUK5:1;
    unsigned CNPUK6:1;
    unsigned CNPUK7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUKbits_t;
extern volatile __CNPUKbits_t CNPUKbits __asm__ ("CNPUK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDK0:1;
    unsigned CNPDK1:1;
    unsigned CNPDK2:1;
    unsigned CNPDK3:1;
    unsigned CNPDK4:1;
    unsigned CNPDK5:1;
    unsigned CNPDK6:1;
    unsigned CNPDK7:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDKbits_t;
extern volatile __CNPDKbits_t CNPDKbits __asm__ ("CNPDK") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDKCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDKSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDKINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONK __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONKbits_t;
