is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecg144.h
#define _PORTK_RK5_POSITION                      0x00000005
#define _PORTK_RK5_MASK                          0x00000020
#define _PORTK_RK5_LENGTH                        0x00000001

#define _PORTK_RK6_POSITION                      0x00000006
#define _PORTK_RK6_MASK                          0x00000040
#define _PORTK_RK6_LENGTH                        0x00000001

#define _PORTK_RK7_POSITION                      0x00000007
#define _PORTK_RK7_MASK                          0x00000080
#define _PORTK_RK7_LENGTH                        0x00000001

#define _PORTK_w_POSITION                        0x00000000
#define _PORTK_w_MASK                            0xFFFFFFFF
#define _PORTK_w_LENGTH                          0x00000020

#define _LATK_LATK0_POSITION                     0x00000000
#define _LATK_LATK0_MASK                         0x00000001
#define _LATK_LATK0_LENGTH                       0x00000001

#define _LATK_LATK1_POSITION                     0x00000001
#define _LATK_LATK1_MASK                         0x00000002
#define _LATK_LATK1_LENGTH                       0x00000001

#define _LATK_LATK2_POSITION                     0x00000002
#define _LATK_LATK2_MASK                         0x00000004
#define _LATK_LATK2_LENGTH                       0x00000001

#define _LATK_LATK3_POSITION                     0x00000003
#define _LATK_LATK3_MASK                         0x00000008
#define _LATK_LATK3_LENGTH                       0x00000001

#define _LATK_LATK4_POSITION                     0x00000004
#define _LATK_LATK4_MASK                         0x00000010
#define _LATK_LATK4_LENGTH                       0x00000001

#define _LATK_LATK5_POSITION                     0x00000005
#define _LATK_LATK5_MASK                         0x00000020
#define _LATK_LATK5_LENGTH                       0x00000001

#define _LATK_LATK6_POSITION                     0x00000006
#define _LATK_LATK6_MASK                         0x00000040
#define _LATK_LATK6_LENGTH                       0x00000001

#define _LATK_LATK7_POSITION                     0x00000007
#define _LATK_LATK7_MASK                         0x00000080
#define _LATK_LATK7_LENGTH                       0x00000001

#define _LATK_w_POSITION                         0x00000000
#define _LATK_w_MASK                             0xFFFFFFFF
#define _LATK_w_LENGTH                           0x00000020

#define _ODCK_ODCK0_POSITION                     0x00000000
#define _ODCK_ODCK0_MASK                         0x00000001
#define _ODCK_ODCK0_LENGTH                       0x00000001

#define _ODCK_ODCK1_POSITION                     0x00000001
#define _ODCK_ODCK1_MASK                         0x00000002
#define _ODCK_ODCK1_LENGTH                       0x00000001

#define _ODCK_ODCK2_POSITION                     0x00000002
#define _ODCK_ODCK2_MASK                         0x00000004
#define _ODCK_ODCK2_LENGTH                       0x00000001

#define _ODCK_ODCK3_POSITION                     0x00000003
#define _ODCK_ODCK3_MASK                         0x00000008
#define _ODCK_ODCK3_LENGTH                       0x00000001

#define _ODCK_ODCK4_POSITION                     0x00000004
#define _ODCK_ODCK4_MASK                         0x00000010
#define _ODCK_ODCK4_LENGTH                       0x00000001

#define _ODCK_ODCK5_POSITION                     0x00000005
#define _ODCK_ODCK5_MASK                         0x00000020
#define _ODCK_ODCK5_LENGTH                       0x00000001

#define _ODCK_ODCK6_POSITION                     0x00000006
#define _ODCK_ODCK6_MASK                         0x00000040
#define _ODCK_ODCK6_LENGTH                       0x00000001

#define _ODCK_ODCK7_POSITION                     0x00000007
#define _ODCK_ODCK7_MASK                         0x00000080
#define _ODCK_ODCK7_LENGTH                       0x00000001

#define _ODCK_w_POSITION                         0x00000000
#define _ODCK_w_MASK                             0xFFFFFFFF
#define _ODCK_w_LENGTH                           0x00000020

#define _CNPUK_CNPUK0_POSITION                   0x00000000
#define _CNPUK_CNPUK0_MASK                       0x00000001
#define _CNPUK_CNPUK0_LENGTH                     0x00000001

#define _CNPUK_CNPUK1_POSITION                   0x00000001
#define _CNPUK_CNPUK1_MASK                       0x00000002
#define _CNPUK_CNPUK1_LENGTH                     0x00000001

#define _CNPUK_CNPUK2_POSITION                   0x00000002
#define _CNPUK_CNPUK2_MASK                       0x00000004
#define _CNPUK_CNPUK2_LENGTH                     0x00000001

#define _CNPUK_CNPUK3_POSITION                   0x00000003
#define _CNPUK_CNPUK3_MASK                       0x00000008
#define _CNPUK_CNPUK3_LENGTH                     0x00000001

#define _CNPUK_CNPUK4_POSITION                   0x00000004
#define _CNPUK_CNPUK4_MASK                       0x00000010
#define _CNPUK_CNPUK4_LENGTH                     0x00000001

#define _CNPUK_CNPUK5_POSITION                   0x00000005
#define _CNPUK_CNPUK5_MASK                       0x00000020
#define _CNPUK_CNPUK5_LENGTH                     0x00000001

#define _CNPUK_CNPUK6_POSITION                   0x00000006
#define _CNPUK_CNPUK6_MASK                       0x00000040
#define _CNPUK_CNPUK6_LENGTH                     0x00000001

#define _CNPUK_CNPUK7_POSITION                   0x00000007
#define _CNPUK_CNPUK7_MASK                       0x00000080
#define _CNPUK_CNPUK7_LENGTH                     0x00000001

#define _CNPUK_w_POSITION                        0x00000000
#define _CNPUK_w_MASK                            0xFFFFFFFF
#define _CNPUK_w_LENGTH                          0x00000020

#define _CNPDK_CNPDK0_POSITION                   0x00000000
#define _CNPDK_CNPDK0_MASK                       0x00000001
#define _CNPDK_CNPDK0_LENGTH                     0x00000001

#define _CNPDK_CNPDK1_POSITION                   0x00000001
#define _CNPDK_CNPDK1_MASK                       0x00000002
#define _CNPDK_CNPDK1_LENGTH                     0x00000001

#define _CNPDK_CNPDK2_POSITION                   0x00000002
#define _CNPDK_CNPDK2_MASK                       0x00000004
#define _CNPDK_CNPDK2_LENGTH                     0x00000001

#define _CNPDK_CNPDK3_POSITION                   0x00000003
#define _CNPDK_CNPDK3_MASK                       0x00000008
#define _CNPDK_CNPDK3_LENGTH                     0x00000001

#define _CNPDK_CNPDK4_POSITION                   0x00000004
#define _CNPDK_CNPDK4_MASK                       0x00000010
#define _CNPDK_CNPDK4_LENGTH                     0x00000001

