is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecg144.h
#define _CNPDK_CNPDK5_POSITION                   0x00000005
#define _CNPDK_CNPDK5_MASK                       0x00000020
#define _CNPDK_CNPDK5_LENGTH                     0x00000001

#define _CNPDK_CNPDK6_POSITION                   0x00000006
#define _CNPDK_CNPDK6_MASK                       0x00000040
#define _CNPDK_CNPDK6_LENGTH                     0x00000001

#define _CNPDK_CNPDK7_POSITION                   0x00000007
#define _CNPDK_CNPDK7_MASK                       0x00000080
#define _CNPDK_CNPDK7_LENGTH                     0x00000001

#define _CNPDK_w_POSITION                        0x00000000
#define _CNPDK_w_MASK                            0xFFFFFFFF
#define _CNPDK_w_LENGTH                          0x00000020

#define _CNCONK_SIDL_POSITION                    0x0000000D
#define _CNCONK_SIDL_MASK                        0x00002000
#define _CNCONK_SIDL_LENGTH                      0x00000001

#define _CNCONK_ON_POSITION                      0x0000000F
#define _CNCONK_ON_MASK                          0x00008000
#define _CNCONK_ON_LENGTH                        0x00000001

#define _CNCONK_w_POSITION                       0x00000000
#define _CNCONK_w_MASK                           0xFFFFFFFF
#define _CNCONK_w_LENGTH                         0x00000020

#define _CNENK_CNIEK0_POSITION                   0x00000000
#define _CNENK_CNIEK0_MASK                       0x00000001
#define _CNENK_CNIEK0_LENGTH                     0x00000001

#define _CNENK_CNIEK1_POSITION                   0x00000001
#define _CNENK_CNIEK1_MASK                       0x00000002
#define _CNENK_CNIEK1_LENGTH                     0x00000001

#define _CNENK_CNIEK2_POSITION                   0x00000002
#define _CNENK_CNIEK2_MASK                       0x00000004
#define _CNENK_CNIEK2_LENGTH                     0x00000001

#define _CNENK_CNIEK3_POSITION                   0x00000003
#define _CNENK_CNIEK3_MASK                       0x00000008
#define _CNENK_CNIEK3_LENGTH                     0x00000001

#define _CNENK_CNIEK4_POSITION                   0x00000004
#define _CNENK_CNIEK4_MASK                       0x00000010
#define _CNENK_CNIEK4_LENGTH                     0x00000001

#define _CNENK_CNIEK5_POSITION                   0x00000005
#define _CNENK_CNIEK5_MASK                       0x00000020
#define _CNENK_CNIEK5_LENGTH                     0x00000001

#define _CNENK_CNIEK6_POSITION                   0x00000006
#define _CNENK_CNIEK6_MASK                       0x00000040
#define _CNENK_CNIEK6_LENGTH                     0x00000001

#define _CNENK_CNIEK7_POSITION                   0x00000007
#define _CNENK_CNIEK7_MASK                       0x00000080
#define _CNENK_CNIEK7_LENGTH                     0x00000001

#define _CNENK_w_POSITION                        0x00000000
#define _CNENK_w_MASK                            0xFFFFFFFF
#define _CNENK_w_LENGTH                          0x00000020

#define _CNSTATK_CNSTATK0_POSITION               0x00000000
#define _CNSTATK_CNSTATK0_MASK                   0x00000001
#define _CNSTATK_CNSTATK0_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK1_POSITION               0x00000001
#define _CNSTATK_CNSTATK1_MASK                   0x00000002
#define _CNSTATK_CNSTATK1_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK2_POSITION               0x00000002
#define _CNSTATK_CNSTATK2_MASK                   0x00000004
#define _CNSTATK_CNSTATK2_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK3_POSITION               0x00000003
#define _CNSTATK_CNSTATK3_MASK                   0x00000008
#define _CNSTATK_CNSTATK3_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK4_POSITION               0x00000004
#define _CNSTATK_CNSTATK4_MASK                   0x00000010
#define _CNSTATK_CNSTATK4_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK5_POSITION               0x00000005
#define _CNSTATK_CNSTATK5_MASK                   0x00000020
#define _CNSTATK_CNSTATK5_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK6_POSITION               0x00000006
#define _CNSTATK_CNSTATK6_MASK                   0x00000040
#define _CNSTATK_CNSTATK6_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK7_POSITION               0x00000007
#define _CNSTATK_CNSTATK7_MASK                   0x00000080
#define _CNSTATK_CNSTATK7_LENGTH                 0x00000001

#define _CNSTATK_w_POSITION                      0x00000000
#define _CNSTATK_w_MASK                          0xFFFFFFFF
#define _CNSTATK_w_LENGTH                        0x00000020

#define _ETHCON1_BUFCDEC_POSITION                0x00000000
#define _ETHCON1_BUFCDEC_MASK                    0x00000001
#define _ETHCON1_BUFCDEC_LENGTH                  0x00000001

#define _ETHCON1_MANFC_POSITION                  0x00000004
#define _ETHCON1_MANFC_MASK                      0x00000010
#define _ETHCON1_MANFC_LENGTH                    0x00000001

#define _ETHCON1_AUTOFC_POSITION                 0x00000007
#define _ETHCON1_AUTOFC_MASK                     0x00000080
#define _ETHCON1_AUTOFC_LENGTH                   0x00000001

#define _ETHCON1_RXEN_POSITION                   0x00000008
#define _ETHCON1_RXEN_MASK                       0x00000100
#define _ETHCON1_RXEN_LENGTH                     0x00000001

#define _ETHCON1_TXRTS_POSITION                  0x00000009
#define _ETHCON1_TXRTS_MASK                      0x00000200
#define _ETHCON1_TXRTS_LENGTH                    0x00000001

#define _ETHCON1_SIDL_POSITION                   0x0000000D
#define _ETHCON1_SIDL_MASK                       0x00002000
#define _ETHCON1_SIDL_LENGTH                     0x00000001

#define _ETHCON1_ON_POSITION                     0x0000000F
#define _ETHCON1_ON_MASK                         0x00008000
#define _ETHCON1_ON_LENGTH                       0x00000001

#define _ETHCON1_PTV_POSITION                    0x00000010
#define _ETHCON1_PTV_MASK                        0xFFFF0000
#define _ETHCON1_PTV_LENGTH                      0x00000010

#define _ETHCON1_w_POSITION                      0x00000000
#define _ETHCON1_w_MASK                          0xFFFFFFFF
#define _ETHCON1_w_LENGTH                        0x00000020

#define _ETHCON2_RXBUF_SZ_POSITION               0x00000004
#define _ETHCON2_RXBUF_SZ_MASK                   0x000007F0
#define _ETHCON2_RXBUF_SZ_LENGTH                 0x00000007

#define _ETHCON2_w_POSITION                      0x00000000
#define _ETHCON2_w_MASK                          0xFFFFFFFF
#define _ETHCON2_w_LENGTH                        0x00000020

#define _ETHTXST_TXSTADDR_POSITION               0x00000002
#define _ETHTXST_TXSTADDR_MASK                   0xFFFFFFFC
#define _ETHTXST_TXSTADDR_LENGTH                 0x0000001E

#define _ETHTXST_w_POSITION                      0x00000000
#define _ETHTXST_w_MASK                          0xFFFFFFFF
#define _ETHTXST_w_LENGTH                        0x00000020

#define _ETHRXST_RXSTADDR_POSITION               0x00000002
#define _ETHRXST_RXSTADDR_MASK                   0xFFFFFFFC
#define _ETHRXST_RXSTADDR_LENGTH                 0x0000001E

